; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v13)
             (pred_12 ?v4 ?v7)
             (pred_9 ?v8 ?v7)
             (pred_2 ?v11 ?v8 )
	     (pred_8 ?v8)
             (pred_1 ?v1)
             (pred_11 ?v4)
             (pred_4 ?v7)
             (pred_3 ?v8)
             (pred_5 ?v4)
             (pred_7 ?v8)
             (pred_10 ))



(:action op_3
:parameters (?v12 ?v2 ?v10 ?v3)
:precondition (and (pred_1 ?v12) (pred_1 ?v2) (pred_11 ?v10) (pred_4 ?v3)
          (pred_6 ?v12 ?v2) (pred_12 ?v10 ?v3)
                   (pred_9 ?v2 ?v3) (pred_8 ?v12) 
                   (pred_3 ?v2) (pred_5 ?v10))
:effect (and  (pred_7 ?v2) (not (pred_3 ?v2))))


(:action op_4
:parameters (?v12 ?v5)
:precondition (and (pred_1 ?v12) (pred_1 ?v5)
               (pred_8 ?v12) (pred_6 ?v12 ?v5) (pred_7 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v12))))

(:action op_1
:parameters (?v12 ?v10)
:precondition (and (pred_1 ?v12) (pred_11 ?v10) 
                  (pred_8 ?v12) (pred_2 ?v10 ?v12) (pred_10 ))
:effect (and (pred_5 ?v10)
   (not (pred_2 ?v10 ?v12)) (not (pred_10 ))))


(:action op_5
:parameters (?v12 ?v9 ?v6)
:precondition (and (pred_1 ?v12) (pred_11 ?v9) (pred_11 ?v6)
                  (pred_8 ?v12) (pred_5 ?v6) (pred_2 ?v9 ?v12))
:effect (and (pred_5 ?v9) (pred_2 ?v6 ?v12)
        (not (pred_5 ?v6)) (not (pred_2 ?v9 ?v12))))

(:action op_2
:parameters (?v12 ?v10)
:precondition (and (pred_1 ?v12) (pred_11 ?v10) 
                  (pred_8 ?v12) (pred_5 ?v10))
:effect (and (pred_10 ) (pred_2 ?v10 ?v12) (not (pred_5 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_03 obj_10 obj_06 obj_04 obj_07 obj_11 obj_13 obj_08
    obj_12 obj_09
    obj_02 obj_01
    )

    (:init
       (pred_10)

       (pred_1 obj_05)
       (pred_1 obj_03)
       (pred_1 obj_10)
       (pred_1 obj_06)
       (pred_1 obj_04)
       (pred_1 obj_07)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_08)
       (pred_4 obj_12)
       (pred_4 obj_09)
       (pred_11 obj_02)
       (pred_11 obj_01)

       (pred_6 obj_05 obj_06)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_04 obj_13)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_03)
       (pred_9  obj_07 obj_12)
       (pred_9  obj_03 obj_09)
       (pred_7 obj_05)
       (pred_7 obj_10)
       (pred_7 obj_06)
       (pred_7 obj_04)
       (pred_7 obj_11)
       (pred_7 obj_13)
       (pred_7 obj_08)

       (pred_12  obj_02 obj_12)
       (pred_12  obj_01 obj_09)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_01 obj_06)
       (pred_8 obj_08)
    )

    (:goal (and
       (pred_2 obj_01 obj_05)
    ))
(:constraints
  (always (not (pred_8 obj_04)))
)
)

; plan
1. (op_4 obj_08 obj_13)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_13)
   goals met: 0 of 1
2. (op_4 obj_13 obj_11)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_06)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_06)
   goals met: 0 of 1
4. (op_1 obj_06 obj_01)
   deleted: (pred_2 obj_01 obj_06) (pred_10)
   added: (pred_5 obj_01)
   goals met: 0 of 1
5. (op_4 obj_06 obj_05)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_05)
   goals met: 0 of 1
6. (op_2 obj_05 obj_01)
   deleted: (pred_5 obj_01)
   added: (pred_10) (pred_2 obj_01 obj_05)
   goals met: 1 of 1
